#รับค่า\ป้อนทางแป้นพิมพ์ ใช้ฟังก์ชั่น input() โดยสิ่งที่ป้อนทั้งหมดถือว่าเป็น String

#ตัวแปร variable เป็น identifier มีหน้าที่เก็บข้อมูลที่เกิดขึ้นในโปรแกรม ข้อมูลที่เก็บจะอยู่ใน RAM
#identifier คือ ชื่อที่ dev. ตั้งขึ้นมาเอง ต้องเป็นไปตามกฎการตั้งชื่อของภาษานั้นๆ

input('ป้อนรหัสนักศฃศึกษา: ')
input('ป้อนชื่อนักศึกษา: ')
input('ป้อนปีเกิด: ') #สิ่งที่ป้อนทั้งหมดถือเป็น String
print('..................................')
print(f"ยินดีต้อนรับ {std_id} ชื่อ {std_name}")
stdAge = 2023 - int(stdYearBron) #ต้องแปลง String เป็น nuber -> int(), float()
print(f"คุณเกิดปี {stdYearBron} อายุ {stdAge}")
print('....................................')
print() #ใช้ ,
print()
print('.....................................')
print() #ใช้ +
print()
print('....................................')
print() #ใช้ เมธอต format
print()
print('.....................................')
print() #ใช้ %
print()